# encoding: utf-8
# language: ru

Функционал: Расчитать возвраст человека в месяцах
	Как Кадровик
	Хочу расчет возвраста человека в месяцах
	Чтобы служба мёдом не казалась

Сценарий: дата рождения 01.01.2016 а дата проверки 01.03.2016
	Допустим есть дата рождения человека 01.01.2016
	И дата проверки 01.03.2016
	Тогда Результат будет равен 2

Сценарий: дата рождения 04.01.2016 а дата проверки 01.06.2016
	Допустим есть дата рождения человека 04.01.2016
	И дата проверки 01.06.2016
	Тогда Результат будет равен 4
